In [2]:
people = {
    'first':['Corey','Jane','John'],
    'last':['Schafer','Doe','Doe'],
    'email':['CoreyMSchafer@email.com','JaneDoe@email.com','JohnDoe@email.com']
}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@email.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [6]:
df['full_name']= df['first'] + ' ' + df['last']

In [7]:
#df.drop(columns='a',inplace = True)

In [8]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@email.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [9]:
df.loc[2,'last'] = 'Smith'

In [10]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@email.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John    Smith        JohnDoe@email.com       John Doe

In [11]:
df.drop(columns = 'first')

      last                    email      full_name
0  Schafer  CoreyMSchafer@email.com  Corey Schafer
1      Doe        JaneDoe@email.com       Jane Doe
2    Smith        JohnDoe@email.com       John Doe

In [12]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@email.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John    Smith        JohnDoe@email.com       John Doe

In [13]:
df.drop(index = 1)

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@email.com  Corey Schafer
2   John    Smith        JohnDoe@email.com       John Doe

In [14]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@email.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John    Smith        JohnDoe@email.com       John Doe

In [15]:
df[['first_name','last_name']] = df['full_name'].str.split(' ',expand = True)

In [16]:
df

   first     last                    email      full_name first_name last_name
0  Corey  Schafer  CoreyMSchafer@email.com  Corey Schafer      Corey   Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe       Jane       Doe
2   John    Smith        JohnDoe@email.com       John Doe       John       Doe

In [17]:
df.drop(columns = 'full_name')

   first     last                    email first_name last_name
0  Corey  Schafer  CoreyMSchafer@email.com      Corey   Schafer
1   Jane      Doe        JaneDoe@email.com       Jane       Doe
2   John    Smith        JohnDoe@email.com       John       Doe

In [18]:
df['full_name'] = df['first_name'] + ' ' +df['last_name']

In [19]:
df.drop(columns = ['first_name','last_name'])

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@email.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John    Smith        JohnDoe@email.com       John Doe

In [20]:
df.append({'first':'my'},ignore_index = True)

C:\Users\piyus\AppData\Local\Temp\ipykernel_13764\3888370368.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first':'my'},ignore_index = True)

   first     last                    email      full_name first_name last_name
0  Corey  Schafer  CoreyMSchafer@email.com  Corey Schafer      Corey   Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe       Jane       Doe
2   John    Smith        JohnDoe@email.com       John Doe       John       Doe
3     my      NaN                      NaN            NaN        NaN       NaN

In [21]:
df.loc[1,'last'] == 'Doe'

True

In [22]:
df = df.append({'first':'my'},ignore_index = True)

C:\Users\piyus\AppData\Local\Temp\ipykernel_13764\1992311781.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append({'first':'my'},ignore_index = True)

In [25]:
df

   first     last                    email      full_name first_name last_name
0  Corey  Schafer  CoreyMSchafer@email.com  Corey Schafer      Corey   Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe       Jane       Doe
2   John    Smith        JohnDoe@email.com       John Doe       John       Doe
3     my      NaN                      NaN            NaN        NaN       NaN

In [28]:
df.drop(index = 3,inplace = True)

In [29]:
df

   first     last                    email      full_name first_name last_name
0  Corey  Schafer  CoreyMSchafer@email.com  Corey Schafer      Corey   Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe       Jane       Doe
2   John    Smith        JohnDoe@email.com       John Doe       John       Doe